[
  {
    "page_content": "404 page not found | University of Toronto Skip to main content 404 page not found We're sorry. It looks like this page has been moved or deleted. Back to homepage",
    "metadata": {
      "source": "https://www.utoronto.ca/international",
      "title": "404 page not found | University of Toronto",
      "crawled_at": "2025-03-01T08:44:57.169173",
      "word_count": 31,
      "status_code": 404,
      "page_type": "international_page",
      "structured_data": {
        "phones": [
          "9153225340",
          "1041546173",
          "1134326665"
        ]
      },
      "description": "We're sorry. It looks like this page was moved or deleted.",
      "largest_section": "main",
      "sections": [
        "main",
        "Main menu tools",
        "Jump to menu",
        "Main navigation",
        "404 page not found",
        "Main navigation repeated",
        "Jump to menu repeated",
        "Quick links"
      ],
      "content_categories": [
        "international"
      ],
      "information_types": "",
      "content_density": 0.0016,
      "content_quality": "low",
      "university": "University of Toronto",
      "from_cache": true
    }
  },
  {
    "page_content": "U of T News U of T ranked 21st in the world based on its reputation for teaching and research UTogether: Your guide to the U of T community Your journey starts here! There’s so much to experience on our three campuses — and UTogether is here to help you thrive in our vibrant university ecosystem. This is your roadmap to essential student, faculty and staff resources , academic and wellness supports , campus maps , where to eat , leadership messages , and more. Take a tour of this resource to discover your U of T! Explore UTogether Latest news February 28, 2025 In photos: U of T's Black History Month Luncheon 2025 February 27, 2025 A social worker experienced in conflict resolution, Faye Mishna to become U of T’s next ombudsperson February 27, 2025 U of T to confer honorary degrees on academic, business and community leaders More U of T News Upcoming events March 3 to March 7, 2025 Entrepreneurship Week 2025 February 28, 2025 Louise Langdon, Garveyism, and the Transformative Power of Black Canadian History in a Moment of Global Crisis March 3, 2025 Share Your Spark: Som Seif in conversation with Stephen Smith More U of T events U of T Celebrates The University of Toronto is home to some of the world’s top faculty, students, alumni and staff. U of T Celebrates recognizes their award-winning accomplishments. Explore U of T Celebrates Research & Innovation Geoffrey Hinton wins 2024 Nobel Prize in Physics From regional Canadian slang to the history of emoji to non-verbal autism, our new issue takes a deep dive into language – and how it affects the way we think, connect and live. Explore the issue Research Neuroscience When words won’t cooperate Psychology professor Morgan Barense aims to crack the mystery of non-speaking autism",
    "metadata": {
      "source": "https://www.utoronto.ca/",
      "title": "University of Toronto",
      "crawled_at": "2025-03-01T08:44:57.813055",
      "word_count": 302,
      "status_code": 200,
      "page_type": "program_page",
      "structured_data": {
        "phones": [
          "9153225340",
          "1041546173",
          "1134326665"
        ],
        "deadline_info": "February 28, 2025\nFebruary 27, 2025\nFebruary 27, 2025\nMarch 3 to March 7, 2025\nFebruary 28, 2025\nMarch 3, 2025\n"
      },
      "description": "The University of Toronto is a globally top-ranked public research university in Toronto, Ontario, Canada.",
      "largest_section": "Jump to menu",
      "sections": [
        "main",
        "Welcome to University of Toronto",
        "Main menu tools",
        "Jump to menu",
        "Main navigation",
        "UTogether: Your guide to the U of T community",
        "Your journey starts here!",
        "Latest news",
        "Upcoming events",
        "Main navigation repeated",
        "Jump to menu repeated",
        "Quick links"
      ],
      "content_categories": [
        "student_life",
        "faculty",
        "international",
        "programs",
        "contact",
        "program"
      ],
      "information_types": "programs,scholarships",
      "content_density": 0.0148,
      "content_quality": "high",
      "university": "University of Toronto",
      "from_cache": true
    }
  },
  {
    "page_content": "Page not found - Future Students. University of Toronto | University of Toronto Oh dear... 404 Page you are looking for is not found Connect With Us",
    "metadata": {
      "source": "https://future.utoronto.ca/scholarships/",
      "title": "Page not found - Future Students. University of Toronto | University of Toronto",
      "crawled_at": "2025-03-01T08:44:59.009166",
      "word_count": 27,
      "status_code": 404,
      "page_type": "contact_page",
      "structured_data": {
        "phones": [
          "1615541452"
        ]
      },
      "largest_section": "main",
      "sections": [
        "main",
        "Oh dear... 404"
      ],
      "content_categories": [
        "contact",
        "tuition"
      ],
      "information_types": "",
      "content_density": 0.0034,
      "content_quality": "low",
      "university": "University of Toronto",
      "from_cache": true
    }
  },
  {
    "page_content": "Academics U of T doesn't do one-size-fits all. The variety and depth of our academic options means you can find the right program to suit your individual interests, while learning from instructors who are leaders in their fields. Canada's top university Year after year, U of T is ranked as Canada’s best university — and one of the top post-secondary institutions in the world . We've also been named the most sustainable university in the world out of more than 1,400 institutions across 95 countries. Learn more about how our research, entrepreneurship and interdisciplinary excellence sets us apart. U of T ranked 21st in the world based on its reputation for teaching and research U of T among top 10 universities powering global innovation U of T ranked first in Canada, among top 30 globally in all subjects: Times Higher Education Programs of study We offer over 700 undergraduate and 200 graduate programs at U of T. Drawing from our top-ranked research faculty, you’ll have the opportunity to learn the latest developments in whatever you choose to study. So whether you are interested in engineering the next breakthrough technology, uncovering the history of Renaissance art, or analyzing how urban politics creates food deserts, you can find it here. Search our programs of study Faculties and academic units Our faculties and divisions provide a home to our academic programs. Within each, you'll find departments, colleges, centres, or institutes, which play an important part in shaping the learning community experience for our students. Learn more about our academic units Beyond degree programs U of T provides more than just degree programs. We are committed to providing access to education for anyone who wants to learn fundamentals and upgrade their skills. Open UToronto Continuing Studies",
    "metadata": {
      "source": "https://www.utoronto.ca/academics",
      "title": "Academics | University of Toronto",
      "crawled_at": "2025-03-01T08:44:59.253791",
      "word_count": 292,
      "status_code": 200,
      "page_type": "program_page",
      "structured_data": {
        "phones": [
          "1882634694",
          "0507430230",
          "1041546173",
          "9153225340",
          "1134326665"
        ],
        "lists": [
          [
            "Open UToronto",
            "Continuing Studies"
          ]
        ]
      },
      "description": "U of T has a variety of courses, programs and graduate programs. Pursue your unique interests while learning from professors who are leaders in their fields.",
      "largest_section": "Academics menu",
      "sections": [
        "main",
        "Main menu tools",
        "Jump to menu",
        "Main navigation",
        "Academics menu",
        "Academics",
        "Canada's top university",
        "Programs of study",
        "Faculties and academic units",
        "Beyond degree programs",
        "Main navigation repeated",
        "Jump to menu repeated",
        "Quick links"
      ],
      "content_categories": [
        "faculty",
        "international",
        "graduate",
        "programs",
        "program"
      ],
      "information_types": "programs",
      "content_density": 0.0157,
      "content_quality": "high",
      "university": "University of Toronto",
      "from_cache": true
    }
  }
]