[
  {
    "page_content": "404 page not found | University of Toronto Skip to main content 404 page not found We're sorry. It looks like this page has been moved or deleted. Back to homepage",
    "metadata": {
      "source": "https://www.utoronto.ca/undergraduate",
      "title": "404 page not found | University of Toronto",
      "crawled_at": "2025-03-01T09:00:36.905809",
      "word_count": 31,
      "status_code": 404,
      "page_type": "general",
      "structured_data": {
        "phones": [
          "1134326665",
          "1041546173",
          "9153225340"
        ]
      },
      "description": "We're sorry. It looks like this page was moved or deleted.",
      "largest_section": "main",
      "sections": [
        "main",
        "Main menu tools",
        "Jump to menu",
        "Main navigation",
        "404 page not found",
        "Main navigation repeated",
        "Jump to menu repeated",
        "Quick links"
      ],
      "content_categories": [
        "graduate"
      ],
      "information_types": "",
      "content_density": 0.0016,
      "content_quality": "low",
      "university": "University of Toronto",
      "from_cache": true
    }
  },
  {
    "page_content": "Financial Aid - Future Students. University of Toronto | University of Toronto Financial Aid Your Future at the University of Toronto is Within Reach We know that financing a university education is no small undertaking. It may involve a mix of financial resources—from student awards to government grants to part-time employment. It will also involve, most importantly, you. In addition to the financial aid programs below, prospective students and their families may wish to consider resources beyond those offered by the government and institution. These may include RESPs; external awards and scholarships offered by community organizations or companies; financial assistance and loans offered through banks and credit unions; part-time employment income; and contributions from family members. At U of T, our goal is to help students like you bring your dream of a university education within reach. Ontario Financial Aid For Ontario residents, the Ontario Student Assistance Program (OSAP) is a government financial aid program made up of a mix of grants and loans. Once you apply and qualify for OSAP, you’ll be considered automatically for other sources of funding, like the University of Toronto Advance Planning for Students (UTAPS) Program. Financial Aid for Ontario Students Canada Financial Aid If you’re from another Canadian province, territory, or First Nations band, you can apply for aid through your government’s financial aid program or your First Nations band. You may also apply for funding through the Out-of-Province University of Toronto Advance Planning for Students (UTAPS) Program. Financial Aid for Canadian Students United States of America Student Aid Students who are U.S. citizens or permanent residents in need of financial aid can explore various funding programs and find out tax information. Financial Aid for U.S. Students International Financial Aid If you’re looking to finance your education, it’s worth finding out about your home country’s financial aid programs to see if you qualify for assistance. U of T, being a publicly-funded institution, is unfortunately only able to offer financial aid to Canadian students. Financial Aid for International Students More About Financing and Funding Your University Education Don’t see what you’re looking for in the list above? Check out the University Registrar’s Office for complete details on the many financial resources and support options to help you finance your education at the University of Toronto. Part-Time Students Indigenous Tuition Initiative Students with Disabilities Emergency Assistance Grants Work Study Other Loans and Lines of Credit FAQ How much does it cost to study at U of T? Your university fees consist of tuition, incidental and ancillary fees, and are based on several factors. In addition, you’ll want to consider other costs such as books, supplies, residence, transportation, food and other expenses. Find out more about the costs associated with university . How do I apply for Financial Aid? If you are a Canadian citizen, permanent resident or protected person, there are many sources of financial aid available to help you cover the costs of your University of Toronto education – from OSAP and other government aid, to assistance provided by the University. Explore your options . If you are an international applicant, you should find out about your home country’s financial aid programs to see if you qualify for assistance. The University of Toronto is a publicly-funded institution and because of that cannot offer financial aid to international students. Find out more about scholarships & awards for international students here. I’m an international applicant, can I receive financial assistance from U of T? The University of Toronto is a publicly-funded institution and because of that cannot offer financial aid to international students. If you are an international applicant, you should find out about your home country’s financial aid programs to see if you qualify for assistance. How do I apply for OSAP? Apply online at https://www.ontario.ca/osap Submit your OSAP application, then print and sign the consents and declaration pages – and any other required supporting documentation – and upload to your account on the OSAP website. Follow the instructions provided to complete your online Master Student Financial Assistance Agreement (MSFAA) with the National Student Loan Service Centre. If you are a returning applicant you may not need to submit any documentation. Find more details on our OSAP FAQ list. How do I apply for Scholarships? Eligible high school students are automatically considered for a variety of admission scholarships when they apply to the University. There are also admissions scholarships that require a separate application, and others that require you to complete an awards profile. Note, however, that the value of scholarships is rarely sufficient to cover all costs the student will incur while attending University of Toronto. Find out more about Scholarships here. How do I contact the Office of University Admissions and Outreach? Telephone & In-Person Inquiries We are available for telephone and in-person inquiries. Email Inquiries Connect with us by email for: Admissions: apply.adm.utoronto.ca/register/questions Ask a Student: apply.adm.utoronto.ca/register/askastudent Contact Client Services for financial aid inquires including: OSAP (Ontario Student Assistant Program) full and part-time BSWD (Bursaries for Students with Disabilities) UTAPS (University of Toronto Advanced Planning for Students) Part-Time Financial OOP Funding for other provinces outside of Ontario US student aid – for United States citizens (US Federal Student Aid loan opportunities, private loans (non-government), Veteran Affairs certification requests for benefits & education tax credit Your feedback is important to us. Please take a couple of minutes to let us know how we did by completing our University Admissions and Outreach Satisfaction Survey . Connect With Us",
    "metadata": {
      "source": "https://future.utoronto.ca/finances/financial-aid/",
      "title": "Financial Aid - Future Students. University of Toronto | University of Toronto",
      "crawled_at": "2025-03-01T09:00:37.145639",
      "word_count": 913,
      "status_code": 200,
      "page_type": "tuition_page",
      "structured_data": {
        "phones": [
          "1156963718"
        ],
        "lists": [
          [
            "How much does it cost to study at U of T?Your university fees consist of tuition, incidental and ancillary fees, and are based on several factors. In addition, you’ll want to consider other costs such as books, supplies, residence, transportation, food and other expenses.Find out more about the costs associated with university.",
            "How do I apply for Financial Aid?If you are a Canadian citizen, permanent resident or protected person, there are many sources of financial aid available to help you cover the costs of your University of Toronto education – from OSAP and other government aid, to assistance provided by the University.Explore your options.If you are an international applicant, you should find out about your home country’s financial aid programs to see if you qualify for assistance. The University of Toronto is a publicly-funded institution and because of that cannot offer financial aid to international students.Find out more about scholarships & awards for international students here.",
            "I’m an international applicant, can I receive financial assistance from U of T?The University of Toronto is a publicly-funded institution and because of that cannot offer financial aid to international students. If you are an international applicant, you should find out about your home country’s financial aid programs to see if you qualify for assistance.",
            "How do I apply for OSAP?Apply online athttps://www.ontario.ca/osapSubmit your OSAP application, then print and sign the consents and declaration pages – and any other required supporting documentation – and upload to your account on the OSAP website.Follow the instructions provided to complete your online Master Student Financial Assistance Agreement (MSFAA) with the National Student Loan Service Centre.If you are a returning applicant you may not need to submit any documentation.Find more details on ourOSAP FAQ list.",
            "How do I apply for Scholarships?Eligible high school students are automatically considered for a variety of admission scholarships when they apply to the University. There are also admissions scholarships that require a separate application, and others that require you to complete an awards profile.Note, however, that the value of scholarships is rarely sufficient to cover all costs the student will incur while attending University of Toronto.Find out more about Scholarships here.",
            "How do I contact the Office of University Admissions and Outreach?Telephone & In-Person InquiriesWe are available for telephone and in-person inquiries.Email InquiriesConnect with us by email for:Admissions:apply.adm.utoronto.ca/register/questionsAsk a Student:apply.adm.utoronto.ca/register/askastudentContactClient Servicesfor financial aid inquires including:OSAP (Ontario Student Assistant Program) full and part-timeBSWD (Bursaries for Students with Disabilities)UTAPS (University of Toronto Advanced Planning for Students)Part-Time FinancialOOP Funding for other provinces outside of OntarioUS student aid – for United States citizens (US Federal Student Aid loan opportunities, private loans (non-government), Veteran Affairs certification requests for benefits & education tax creditYour feedback is important to us. Please take a couple of minutes to let us know how we did by completing ourUniversity Admissions and Outreach Satisfaction Survey.",
            "Admissions:apply.adm.utoronto.ca/register/questions",
            "Ask a Student:apply.adm.utoronto.ca/register/askastudent",
            "OSAP (Ontario Student Assistant Program) full and part-time",
            "BSWD (Bursaries for Students with Disabilities)",
            "UTAPS (University of Toronto Advanced Planning for Students)",
            "Part-Time Financial",
            "OOP Funding for other provinces outside of Ontario",
            "US student aid – for United States citizens (US Federal Student Aid loan opportunities, private loans (non-government), Veteran Affairs certification requests for benefits & education tax credit"
          ],
          [
            "Admissions:apply.adm.utoronto.ca/register/questions",
            "Ask a Student:apply.adm.utoronto.ca/register/askastudent"
          ],
          [
            "OSAP (Ontario Student Assistant Program) full and part-time",
            "BSWD (Bursaries for Students with Disabilities)",
            "UTAPS (University of Toronto Advanced Planning for Students)",
            "Part-Time Financial",
            "OOP Funding for other provinces outside of Ontario",
            "US student aid – for United States citizens (US Federal Student Aid loan opportunities, private loans (non-government), Veteran Affairs certification requests for benefits & education tax credit"
          ]
        ]
      },
      "largest_section": "More About Financing and Funding Your University Education",
      "sections": [
        "main",
        "Financial Aid",
        "Your Future at the University of Toronto is Within Reach",
        "Ontario Financial Aid",
        "Canada Financial Aid",
        "United States of America Student Aid",
        "International Financial Aid",
        "More About Financing and Funding Your University Education"
      ],
      "content_categories": [
        "tuition",
        "program",
        "admission",
        "contact",
        "international"
      ],
      "information_types": "",
      "content_density": 0.0913,
      "content_quality": "high",
      "university": "University of Toronto",
      "from_cache": true
    }
  },
  {
    "page_content": "About U of T Founded in 1827, the University of Toronto is Canada’s top university with a long history of challenging the impossible and transforming society through the ingenuity and resolve of its faculty, students, alumni and supporters. We are proud to be one of the world’s top research-intensive universities, bringing together top minds from every conceivable background and discipline to collaborate on the world’s most pressing challenges. Our community is a catalyst for discovery, innovation and progress, creating knowledge and solutions that make a tangible difference around the globe. And we prepare our students for success through an outstanding global education rooted in excellence, inclusion and close-knit learning communities. The ideas, innovations and contributions of more than 680,000 graduates advance U of T’s impact on communities across the globe. Together, we continue to defy gravity by taking on what might seem unattainable today and generating the ideas and talent needed to build a more equitable, sustainable and prosperous future. The diversity of the U of T community is our strength “U of T’s remarkable diversity provides both a springboard to social mobility and a superb environment for education, research and innovation.” — Meric Gertler, President, University of Toronto Deeply rooted in one of the world’s most diverse city regions, U of T is committed to inclusive excellence — the idea that every member of our community should thrive in an environment of belonging. A welcoming and global community that supports equity, diversity and inclusion (EDI) for all is an essential part of our University. Read about our committment to EDI Strategic priorities The University of Toronto's strategic priorities provide a framework for working towards the goals of our shared community. The three priorities identified in our Towards 2030 plan are our commitment to achieving these goals. We aim to: leverage our urban location(s) more fully, for the mutual benefit of the University and the City, strengthen and deepen key international partnerships through a well-defined strategic focus, and re-imagine and reinvent undergraduate education. One university, three campuses Explore U of T Mississauga Explore U of T St. George Explore U of T Scarborough Facts and figures Sustainability 1st in the world for sustainability (QS Rankings 2024) Research citations Top 3 in the world for research citations (Incites 2018–2022) Scientific papers 4th in the world for performance ranking of scientific papers (National Taiwan University Ranking, 2024) Employability 12th in the world for graduate employability (Times Higher Education, 2023) Alumni More than 680,600 alumni in more than 190 countries and territories Nobel laureates 9 winners of the Nobel Prize Canada Research Chairs 311 tenured-stream faculty are Canada Research Chairs Entrepreneurship No. 1 rank in research-based startups among Canadian universities (THE, U.S. News, QS World Report) Medical research 2nd in the world for medical research (U of T and leading Toronto hospitals) (Incites 2018–2022) Global ranking Top 50 globally in 46 subject categories, more than any other university in the world (QS World University Rankings by Subject 2024) Research collaborations Research collaborations with more than 1,200 institutions (Clarivate, Web of Science; U of T 2020-2022) Business incubation U of T ranks in the world’s top 5 university-managed business incubators (UBI Global World Benchmark Study, 2021-22) Quick facts Reports and accountability U of T's senior leadership The Governing Council , established by the University of Toronto Act, 1971, oversees the academic, business and student affairs of the University. Together with the Chancellor, President and senior administration, the Council represents the University’s vision, mission and purpose both locally and globally. Meric Gertler President Wesley J. Hall Chancellor Trevor Young Vice-President and Provost Alexandra Gillespie Vice-President, and Principal, U of T Mississauga Linda Johnston Vice-President, and Principal, U of T Scarborough Leah Cowen Vice-President, Research and Innovation, and Strategic Initiatives Kelly Hannah-Moffat Vice-President, People Strategy, Equity and Culture Scott Mabury Vice-President, Operations and Real Estate Partnerships, and Vice-Provost, Academic David Palmer Vice-President, Advancement Christine Szustaczek Vice-President, Communications Andrew Thomson Chief of Government Relations Joseph Wong Vice-President, International Learning for any stage of life Undergraduate programs Graduate programs Postdoctoral fellowships Continuing studies Discover U of T job opportunities",
    "metadata": {
      "source": "https://www.utoronto.ca/about-u-of-t",
      "title": "About U of T | University of Toronto",
      "crawled_at": "2025-03-01T09:00:39.636700",
      "word_count": 681,
      "status_code": 200,
      "page_type": "program_page",
      "structured_data": {
        "phones": [
          "1134326665",
          "1041546173",
          "9153225340"
        ],
        "lists": [
          [
            "leverage our urban location(s) more fully, for the mutual benefit of the University and the City,",
            "strengthen and deepen key international partnerships through a well-defined strategic focus, and",
            "re-imagine and reinvent undergraduate education."
          ]
        ]
      },
      "description": "Learn more about the University of Toronto, Canada's leading institution of learning, discovery and knowledge.",
      "largest_section": "About U of T menu",
      "sections": [
        "main",
        "Main menu tools",
        "Jump to menu",
        "Main navigation",
        "About U of T menu",
        "About U of T",
        "The diversity of the U of T community is our strength",
        "Strategic priorities",
        "One university, three campuses",
        "Facts and figures",
        "U of T's senior leadership",
        "Meric Gertler",
        "Wesley J. Hall",
        "Trevor Young",
        "Alexandra Gillespie",
        "Linda Johnston",
        "Leah Cowen",
        "Kelly Hannah-Moffat",
        "Scott Mabury",
        "David Palmer",
        "Christine Szustaczek",
        "Andrew Thomson",
        "Joseph Wong",
        "Learning for any stage of life",
        "Main navigation repeated",
        "Jump to menu repeated",
        "Quick links"
      ],
      "content_categories": [
        "graduate",
        "faculty",
        "student_life",
        "program",
        "programs",
        "contact",
        "international"
      ],
      "information_types": "",
      "content_density": 0.0331,
      "content_quality": "high",
      "university": "University of Toronto",
      "from_cache": true
    }
  },
  {
    "page_content": "Page not found - Future Students. University of Toronto | University of Toronto Oh dear... 404 Page you are looking for is not found Connect With Us",
    "metadata": {
      "source": "https://future.utoronto.ca/finances/tuition/",
      "title": "Page not found - Future Students. University of Toronto | University of Toronto",
      "crawled_at": "2025-03-01T09:00:42.125563",
      "word_count": 27,
      "status_code": 404,
      "page_type": "tuition_page",
      "structured_data": {
        "phones": [
          "1541726670"
        ]
      },
      "largest_section": "main",
      "sections": [
        "main",
        "Oh dear... 404"
      ],
      "content_categories": [
        "contact",
        "tuition"
      ],
      "information_types": "",
      "content_density": 0.0034,
      "content_quality": "low",
      "university": "University of Toronto",
      "from_cache": true
    }
  },
  {
    "page_content": "Academics U of T doesn't do one-size-fits all. The variety and depth of our academic options means you can find the right program to suit your individual interests, while learning from instructors who are leaders in their fields. Canada's top university Year after year, U of T is ranked as Canada’s best university — and one of the top post-secondary institutions in the world . We've also been named the most sustainable university in the world out of more than 1,400 institutions across 95 countries. Learn more about how our research, entrepreneurship and interdisciplinary excellence sets us apart. U of T ranked 21st in the world based on its reputation for teaching and research U of T among top 10 universities powering global innovation U of T ranked first in Canada, among top 30 globally in all subjects: Times Higher Education Programs of study We offer over 700 undergraduate and 200 graduate programs at U of T. Drawing from our top-ranked research faculty, you’ll have the opportunity to learn the latest developments in whatever you choose to study. So whether you are interested in engineering the next breakthrough technology, uncovering the history of Renaissance art, or analyzing how urban politics creates food deserts, you can find it here. Search our programs of study Faculties and academic units Our faculties and divisions provide a home to our academic programs. Within each, you'll find departments, colleges, centres, or institutes, which play an important part in shaping the learning community experience for our students. Learn more about our academic units Beyond degree programs U of T provides more than just degree programs. We are committed to providing access to education for anyone who wants to learn fundamentals and upgrade their skills. Open UToronto Continuing Studies",
    "metadata": {
      "source": "https://www.utoronto.ca/academics",
      "title": "Academics | University of Toronto",
      "crawled_at": "2025-03-01T09:00:42.531293",
      "word_count": 292,
      "status_code": 200,
      "page_type": "program_page",
      "structured_data": {
        "phones": [
          "1882634694",
          "1041546173",
          "0507430230",
          "9153225340",
          "1134326665"
        ],
        "lists": [
          [
            "Open UToronto",
            "Continuing Studies"
          ]
        ]
      },
      "description": "U of T has a variety of courses, programs and graduate programs. Pursue your unique interests while learning from professors who are leaders in their fields.",
      "largest_section": "Academics menu",
      "sections": [
        "main",
        "Main menu tools",
        "Jump to menu",
        "Main navigation",
        "Academics menu",
        "Academics",
        "Canada's top university",
        "Programs of study",
        "Faculties and academic units",
        "Beyond degree programs",
        "Main navigation repeated",
        "Jump to menu repeated",
        "Quick links"
      ],
      "content_categories": [
        "graduate",
        "faculty",
        "program",
        "programs",
        "international"
      ],
      "information_types": "",
      "content_density": 0.0157,
      "content_quality": "high",
      "university": "University of Toronto",
      "from_cache": true
    }
  },
  {
    "page_content": "U of T News U of T ranked 21st in the world based on its reputation for teaching and research UTogether: Your guide to the U of T community Your journey starts here! There’s so much to experience on our three campuses — and UTogether is here to help you thrive in our vibrant university ecosystem. This is your roadmap to essential student, faculty and staff resources , academic and wellness supports , campus maps , where to eat , leadership messages , and more. Take a tour of this resource to discover your U of T! Explore UTogether Latest news February 28, 2025 In photos: U of T's Black History Month Luncheon 2025 February 27, 2025 A social worker experienced in conflict resolution, Faye Mishna to become U of T’s next ombudsperson February 27, 2025 U of T to confer honorary degrees on academic, business and community leaders More U of T News Upcoming events March 3 to March 7, 2025 Entrepreneurship Week 2025 February 28, 2025 Louise Langdon, Garveyism, and the Transformative Power of Black Canadian History in a Moment of Global Crisis March 3, 2025 Share Your Spark: Som Seif in conversation with Stephen Smith More U of T events U of T Celebrates The University of Toronto is home to some of the world’s top faculty, students, alumni and staff. U of T Celebrates recognizes their award-winning accomplishments. Explore U of T Celebrates Research & Innovation Geoffrey Hinton wins 2024 Nobel Prize in Physics From regional Canadian slang to the history of emoji to non-verbal autism, our new issue takes a deep dive into language – and how it affects the way we think, connect and live. Explore the issue Research Neuroscience When words won’t cooperate Psychology professor Morgan Barense aims to crack the mystery of non-speaking autism",
    "metadata": {
      "source": "https://www.utoronto.ca/",
      "title": "University of Toronto",
      "crawled_at": "2025-03-01T09:00:43.220557",
      "word_count": 302,
      "status_code": 200,
      "page_type": "program_page",
      "structured_data": {
        "phones": [
          "1134326665",
          "1041546173",
          "9153225340"
        ],
        "deadline_info": "February 28, 2025\nFebruary 27, 2025\nFebruary 27, 2025\nMarch 3 to March 7, 2025\nFebruary 28, 2025\nMarch 3, 2025\n"
      },
      "description": "The University of Toronto is a globally top-ranked public research university in Toronto, Ontario, Canada.",
      "largest_section": "Jump to menu",
      "sections": [
        "main",
        "Welcome to University of Toronto",
        "Main menu tools",
        "Jump to menu",
        "Main navigation",
        "UTogether: Your guide to the U of T community",
        "Your journey starts here!",
        "Latest news",
        "Upcoming events",
        "Main navigation repeated",
        "Jump to menu repeated",
        "Quick links"
      ],
      "content_categories": [
        "faculty",
        "student_life",
        "program",
        "programs",
        "contact",
        "international"
      ],
      "information_types": "",
      "content_density": 0.0148,
      "content_quality": "high",
      "university": "University of Toronto",
      "from_cache": true
    }
  },
  {
    "page_content": "Finances - Future Students. University of Toronto | University of Toronto Finances Fees Learn about the costs associated with attending university. Get the Big Picture Awards (Scholarships and Grants) Our student awards (scholarships and grants) programs recognize a wide range of achievements — everything from academic excellence and leadership to community engagement and creative accomplishments. Explore What's Available Financial Aid There are many sources of financial aid available to help you cover the costs of your education — from OSAP and other government programs to aid provided by the University of Toronto. Explore Your Options FAQ How much does it cost to study at U of T? Your university fees consist of tuition, incidental and ancillary fees, and are based on several factors. In addition, you’ll want to consider other costs such as books, supplies, residence, transportation, food and other expenses. Find out more about the costs associated with university . How do I apply for Financial Aid? If you are a Canadian citizen, permanent resident or protected person, there are many sources of financial aid available to help you cover the costs of your University of Toronto education – from OSAP and other government aid, to assistance provided by the University. Explore your options . If you are an international applicant, you should find out about your home country’s financial aid programs to see if you qualify for assistance. The University of Toronto is a publicly-funded institution and because of that cannot offer financial aid to international students. Find out more about scholarships & awards for international students here. I’m an international applicant, can I receive financial assistance from U of T? The University of Toronto is a publicly-funded institution and because of that cannot offer financial aid to international students. If you are an international applicant, you should find out about your home country’s financial aid programs to see if you qualify for assistance. How do I apply for OSAP? Apply online at https://www.ontario.ca/osap Submit your OSAP application, then print and sign the consents and declaration pages – and any other required supporting documentation – and upload to your account on the OSAP website. Follow the instructions provided to complete your online Master Student Financial Assistance Agreement (MSFAA) with the National Student Loan Service Centre. If you are a returning applicant you may not need to submit any documentation. Find more details on our OSAP FAQ list. How do I apply for Scholarships? Eligible high school students are automatically considered for a variety of admission scholarships when they apply to the University. There are also admissions scholarships that require a separate application, and others that require you to complete an awards profile. Note, however, that the value of scholarships is rarely sufficient to cover all costs the student will incur while attending University of Toronto. Find out more about Scholarships here. How do I contact the Office of University Admissions and Outreach? Telephone & In-Person Inquiries We are available for telephone and in-person inquiries. Email Inquiries Connect with us by email for: Admissions: apply.adm.utoronto.ca/register/questions Ask a Student: apply.adm.utoronto.ca/register/askastudent Contact Client Services for financial aid inquires including: OSAP (Ontario Student Assistant Program) full and part-time BSWD (Bursaries for Students with Disabilities) UTAPS (University of Toronto Advanced Planning for Students) Part-Time Financial OOP Funding for other provinces outside of Ontario US student aid – for United States citizens (US Federal Student Aid loan opportunities, private loans (non-government), Veteran Affairs certification requests for benefits & education tax credit Your feedback is important to us. Please take a couple of minutes to let us know how we did by completing our University Admissions and Outreach Satisfaction Survey . Connect With Us",
    "metadata": {
      "source": "https://future.utoronto.ca/finances/",
      "title": "Finances - Future Students. University of Toronto | University of Toronto",
      "crawled_at": "2025-03-01T09:00:43.658920",
      "word_count": 609,
      "status_code": 200,
      "page_type": "admission_page",
      "structured_data": {
        "phones": [
          "1098566587",
          "1396859857",
          "1070635925"
        ],
        "lists": [
          [
            "How much does it cost to study at U of T?Your university fees consist of tuition, incidental and ancillary fees, and are based on several factors. In addition, you’ll want to consider other costs such as books, supplies, residence, transportation, food and other expenses.Find out more about the costs associated with university.",
            "How do I apply for Financial Aid?If you are a Canadian citizen, permanent resident or protected person, there are many sources of financial aid available to help you cover the costs of your University of Toronto education – from OSAP and other government aid, to assistance provided by the University.Explore your options.If you are an international applicant, you should find out about your home country’s financial aid programs to see if you qualify for assistance. The University of Toronto is a publicly-funded institution and because of that cannot offer financial aid to international students.Find out more about scholarships & awards for international students here.",
            "I’m an international applicant, can I receive financial assistance from U of T?The University of Toronto is a publicly-funded institution and because of that cannot offer financial aid to international students. If you are an international applicant, you should find out about your home country’s financial aid programs to see if you qualify for assistance.",
            "How do I apply for OSAP?Apply online athttps://www.ontario.ca/osapSubmit your OSAP application, then print and sign the consents and declaration pages – and any other required supporting documentation – and upload to your account on the OSAP website.Follow the instructions provided to complete your online Master Student Financial Assistance Agreement (MSFAA) with the National Student Loan Service Centre.If you are a returning applicant you may not need to submit any documentation.Find more details on ourOSAP FAQ list.",
            "How do I apply for Scholarships?Eligible high school students are automatically considered for a variety of admission scholarships when they apply to the University. There are also admissions scholarships that require a separate application, and others that require you to complete an awards profile.Note, however, that the value of scholarships is rarely sufficient to cover all costs the student will incur while attending University of Toronto.Find out more about Scholarships here.",
            "How do I contact the Office of University Admissions and Outreach?Telephone & In-Person InquiriesWe are available for telephone and in-person inquiries.Email InquiriesConnect with us by email for:Admissions:apply.adm.utoronto.ca/register/questionsAsk a Student:apply.adm.utoronto.ca/register/askastudentContactClient Servicesfor financial aid inquires including:OSAP (Ontario Student Assistant Program) full and part-timeBSWD (Bursaries for Students with Disabilities)UTAPS (University of Toronto Advanced Planning for Students)Part-Time FinancialOOP Funding for other provinces outside of OntarioUS student aid – for United States citizens (US Federal Student Aid loan opportunities, private loans (non-government), Veteran Affairs certification requests for benefits & education tax creditYour feedback is important to us. Please take a couple of minutes to let us know how we did by completing ourUniversity Admissions and Outreach Satisfaction Survey.",
            "Admissions:apply.adm.utoronto.ca/register/questions",
            "Ask a Student:apply.adm.utoronto.ca/register/askastudent",
            "OSAP (Ontario Student Assistant Program) full and part-time",
            "BSWD (Bursaries for Students with Disabilities)",
            "UTAPS (University of Toronto Advanced Planning for Students)",
            "Part-Time Financial",
            "OOP Funding for other provinces outside of Ontario",
            "US student aid – for United States citizens (US Federal Student Aid loan opportunities, private loans (non-government), Veteran Affairs certification requests for benefits & education tax credit"
          ],
          [
            "Admissions:apply.adm.utoronto.ca/register/questions",
            "Ask a Student:apply.adm.utoronto.ca/register/askastudent"
          ],
          [
            "OSAP (Ontario Student Assistant Program) full and part-time",
            "BSWD (Bursaries for Students with Disabilities)",
            "UTAPS (University of Toronto Advanced Planning for Students)",
            "Part-Time Financial",
            "OOP Funding for other provinces outside of Ontario",
            "US student aid – for United States citizens (US Federal Student Aid loan opportunities, private loans (non-government), Veteran Affairs certification requests for benefits & education tax credit"
          ]
        ]
      },
      "largest_section": "Financial Aid",
      "sections": [
        "main",
        "Finances",
        "Fees",
        "Awards (Scholarships and Grants)",
        "Financial Aid"
      ],
      "content_categories": [
        "tuition",
        "graduate",
        "student_life",
        "program",
        "programs",
        "admission",
        "contact",
        "international"
      ],
      "information_types": "",
      "content_density": 0.0677,
      "content_quality": "high",
      "university": "University of Toronto",
      "from_cache": true
    }
  },
  {
    "page_content": "University Fees How Much Will University Cost? The amount of tuition you pay will depend on factors such as your program and year of study, your course load and your campus. While the exact tuition fees for each academic year are typically finalized in the spring, you can take a look at the previous year’s amounts in your area of study to get an idea of how much you’ll pay in tuition. Remember that in addition to tuition, your total fees will include incidental and ancillary fees. Look up Tuition Fees for your area of study. Final tuition, fee schedules, and payment information are posted on the Student Accounts website . Incidental and Ancillary Fees Non-Academic Incidental Fees (or Incidental Fees) contribute to things like student societies, campus-based services, athletics and recreation facilities, and student health and dental plans. Many of these fees are compulsory, but you will have the option of opting out of a small proportion of them. Ancillary fees cover things like field-trip costs, or special equipment provided for coursework, as well as administrative costs such as transcript fees or library fines. Find out more about Incidental & Ancillary Fees. Other Costs of University There are a number of other costs to factor into your budget – for example, the cost of books, educational supplies, food, and residence. And international students should also factor in the University Health Insurance Plan (UHIP). Find more about other costs of attending university. To get a better idea of how much money you will need to cover tuition and fees, housing costs, food and everything else for the upcoming academic year, use our financial planning calculator to budget your costs. This is only a rough estimate on the cost of university, but should give you an idea about how much to budget. Find out more about registration steps and deadlines, including instructions on paying your fees and requesting a tuition fee deferral.",
    "metadata": {
      "source": "https://future.utoronto.ca/finances/fees/",
      "title": "University Fees - Future Students. University of Toronto | University of Toronto",
      "crawled_at": "2025-03-01T09:00:44.658708",
      "word_count": 321,
      "status_code": 200,
      "page_type": "tuition_page",
      "structured_data": {
        "phones": [
          "1732605675",
          "1799336472",
          "1691727327",
          "1485572115"
        ],
        "lists": [
          [
            "University FeesOther Costs of University",
            "Other Costs of University",
            "Student AwardsAwards ProfileAdmission AwardsInternational Students",
            "Awards Profile",
            "Admission Awards",
            "International Students",
            "Financial AidOntario Financial AidCanada Financial AidUnited States of America Student AidInternational Student Aid",
            "Ontario Financial Aid",
            "Canada Financial Aid",
            "United States of America Student Aid",
            "International Student Aid"
          ],
          [
            "Awards Profile",
            "Admission Awards",
            "International Students"
          ],
          [
            "Ontario Financial Aid",
            "Canada Financial Aid",
            "United States of America Student Aid",
            "International Student Aid"
          ],
          [
            "How much does it cost to study at U of T?Your university fees consist of tuition, incidental and ancillary fees, and are based on several factors. In addition, you’ll want to consider other costs such as books, supplies, residence, transportation, food and other expenses.Find out more about the costs associated with university.",
            "How do I apply for Financial Aid?If you are a Canadian citizen, permanent resident or protected person, there are many sources of financial aid available to help you cover the costs of your University of Toronto education – from OSAP and other government aid, to assistance provided by the University.Explore your options.If you are an international applicant, you should find out about your home country’s financial aid programs to see if you qualify for assistance. The University of Toronto is a publicly-funded institution and because of that cannot offer financial aid to international students.Find out more about scholarships & awards for international students here.",
            "I’m an international applicant, can I receive financial assistance from U of T?The University of Toronto is a publicly-funded institution and because of that cannot offer financial aid to international students. If you are an international applicant, you should find out about your home country’s financial aid programs to see if you qualify for assistance.",
            "How do I apply for OSAP?Apply online athttps://www.ontario.ca/osapSubmit your OSAP application, then print and sign the consents and declaration pages – and any other required supporting documentation – and upload to your account on the OSAP website.Follow the instructions provided to complete your online Master Student Financial Assistance Agreement (MSFAA) with the National Student Loan Service Centre.If you are a returning applicant you may not need to submit any documentation.Find more details on ourOSAP FAQ list.",
            "How do I apply for Scholarships?Eligible high school students are automatically considered for a variety of admission scholarships when they apply to the University. There are also admissions scholarships that require a separate application, and others that require you to complete an awards profile.Note, however, that the value of scholarships is rarely sufficient to cover all costs the student will incur while attending University of Toronto.Find out more about Scholarships here.",
            "How do I contact the Office of University Admissions and Outreach?Telephone & In-Person InquiriesWe are available for telephone and in-person inquiries.Email InquiriesConnect with us by email for:Admissions:apply.adm.utoronto.ca/register/questionsAsk a Student:apply.adm.utoronto.ca/register/askastudentContactClient Servicesfor financial aid inquires including:OSAP (Ontario Student Assistant Program) full and part-timeBSWD (Bursaries for Students with Disabilities)UTAPS (University of Toronto Advanced Planning for Students)Part-Time FinancialOOP Funding for other provinces outside of OntarioUS student aid – for United States citizens (US Federal Student Aid loan opportunities, private loans (non-government), Veteran Affairs certification requests for benefits & education tax creditYour feedback is important to us. Please take a couple of minutes to let us know how we did by completing ourUniversity Admissions and Outreach Satisfaction Survey.",
            "Admissions:apply.adm.utoronto.ca/register/questions",
            "Ask a Student:apply.adm.utoronto.ca/register/askastudent",
            "OSAP (Ontario Student Assistant Program) full and part-time",
            "BSWD (Bursaries for Students with Disabilities)",
            "UTAPS (University of Toronto Advanced Planning for Students)",
            "Part-Time Financial",
            "OOP Funding for other provinces outside of Ontario",
            "US student aid – for United States citizens (US Federal Student Aid loan opportunities, private loans (non-government), Veteran Affairs certification requests for benefits & education tax credit"
          ],
          [
            "Admissions:apply.adm.utoronto.ca/register/questions",
            "Ask a Student:apply.adm.utoronto.ca/register/askastudent"
          ],
          [
            "OSAP (Ontario Student Assistant Program) full and part-time",
            "BSWD (Bursaries for Students with Disabilities)",
            "UTAPS (University of Toronto Advanced Planning for Students)",
            "Part-Time Financial",
            "OOP Funding for other provinces outside of Ontario",
            "US student aid – for United States citizens (US Federal Student Aid loan opportunities, private loans (non-government), Veteran Affairs certification requests for benefits & education tax credit"
          ]
        ]
      },
      "largest_section": "Other Costs of University",
      "sections": [
        "main",
        "Finances",
        "How Much Will University Cost?",
        "Incidental and Ancillary Fees",
        "Other Costs of University"
      ],
      "content_categories": [
        "international",
        "tuition",
        "deadline",
        "program"
      ],
      "information_types": "",
      "content_density": 0.0325,
      "content_quality": "high",
      "university": "University of Toronto",
      "from_cache": true
    }
  },
  {
    "page_content": "Apply - Future Students. University of Toronto | University of Toronto Apply to U of T Admissions The University of Toronto offers an unparalleled array of academic opportunities and experiences. Find out about U of T’s undergraduate admission requirements and what you will need to present based on your academic background. Learn about specific program requirements, English language requirements, transfer credit information, and important application dates and deadlines. Requirements Transfer Credit Information English Language Requirements Important Application Dates Protect Yourself from Fraud Details for Visiting Students Details for Non-Degree Students How to Apply Ready to apply to the University of Toronto and join one of the world’s top universities? Select the appropriate online application in this section and learn about each step in our application process. You’ll also learn more about submitting academic records and other required documents, and how to monitor the status of your application after you’ve applied. Applying To-Do List FAQ How do I apply to U of T? Find out which application you should use , depending on whether you’re a current Ontario high school student, an applicant from another Canadian province or territory, an international applicant, or in another circumstance. When do I need to apply? Make sure you check the Important Application Dates to find out when your application, required documents, and other supplementary documents are due. Do I need to fill out a supplementary application or student profile? It depends on what you’re applying to, but most programs do not require additional applications. Some programs, colleges and campuses ask students to fill out an added application or profile. You should receive an email that will indicate if you need to fill out an application, where you can find it and what the deadline is. You can also find this information by looking up your intended program’s requirements in the Program Finder . What courses do students from outside of Canada need to apply to U of T? Find out about academic requirements for applicants from outside Canada . What English language requirements do I need to be accepted to U of T? Find out about U of T’s English Language Requirements and proof of English facility . If I’ve done Advanced Placement or International Baccalaureate, will I be eligible for transfer credits? If you have completed college or university studies, AP, IB, GCE, CAPE, or French Bacc. examinations you may be eligible for transfer credit at the University of Toronto. Transfer credits are assessed after admission. Find out more about transfer credits at U of T. I’ve applied to study at U of T, but I want to change my program choices. How can I make changes to my application? All changes to your application should be made before the application deadline . If you have applied using the OUAC Undergraduate Application and wish to make changes to your initial application, you must do this by logging in to the Ontario Universities’ Application Centre website . All other applicants (International/Internal/Part-Time/Non-Degree) should log onto JOIN U of T , click on Check Status, and follow the instructions for making changes to your application. We do not accept any changes or corrections via email or telephone. When will I hear from the university after I submit my application? You will receive an acknowledgment from U of T, with login instructions for our applicant website, JOIN U of T , about two weeks after you submit your application. How do I contact University Admissions and Outreach? Telephone & In-Person Inquiries We are available for telephone and in-person inquiries. Email Inquiries Connect with us by email for: Admissions: apply.adm.utoronto.ca/register/questions Ask a Student: apply.adm.utoronto.ca/register/askastudent Contact Client Services for financial aid inquires including: OSAP (Ontario Student Assistant Program) full and part-time BSWD (Bursaries for Students with Disabilities) UTAPS (University of Toronto Advanced Planning for Students) Part-Time Financial OOP Funding for other provinces outside of Ontario US student aid – for United States citizens (US Federal Student Aid loan opportunities, private loans (non-government), Veteran Affairs certification requests for benefits & education tax credit Your feedback is important to us. Please take a couple of minutes to let us know how we did by completing our University Admissions and Outreach Satisfaction Survey . How can I defer my offer of admission? If you are unable to begin your degree studies in the fall, you may request a one-year deferral of your offer of admission. Deferrals are not guaranteed and will be reviewed on a case-by-case basis. Check out further information on deferring an offer of admission . Connect With Us",
    "metadata": {
      "source": "https://future.utoronto.ca/apply/",
      "title": "Apply - Future Students. University of Toronto | University of Toronto",
      "crawled_at": "2025-03-01T09:00:45.040835",
      "word_count": 759,
      "status_code": 200,
      "page_type": "admission_page",
      "structured_data": {
        "phones": [
          "1339702111",
          "1553895186",
          "1874516573"
        ],
        "lists": [
          [
            "How do I apply to U of T?Find outwhich application you should use, depending on whether you’re a current Ontario high school student, an applicant from another Canadian province or territory, an international applicant, or in another circumstance.",
            "When do I need to apply?Make sure you check theImportant Application Datesto find out when your application, required documents, and other supplementary documents are due.",
            "Do I need to fill out a supplementary application or student profile?It depends on what you’re applying to, but most programs do not require additional applications. Some programs, colleges and campuses ask students to fill out an added application or profile. You should receive an email that will indicate if you need to fill out an application, where you can find it and what the deadline is. You can also find this information by looking up your intended program’s requirements in theProgram Finder.",
            "What courses do students from outside of Canada need to apply to U of T?Find out aboutacademic requirements for applicants from outside Canada.",
            "What English language requirements do I need to be accepted to U of T?Find out aboutU of T’s English Language Requirements and proof of English facility.",
            "If I’ve done Advanced Placement or International Baccalaureate, will I be eligible for transfer credits?If you have completed college or university studies, AP, IB, GCE, CAPE, or French Bacc. examinations you may be eligible for transfer credit at the University of Toronto. Transfer credits are assessed after admission.Find out more abouttransfer creditsat U of T.",
            "I’ve applied to study at U of T, but I want to change my program choices. How can I make changes to my application?All changes to your application should be made before theapplication deadline.If you have applied using the OUAC Undergraduate Application and wish to make changes to your initial application, you must do this by logging in to theOntario Universities’ Application Centre website.All other applicants (International/Internal/Part-Time/Non-Degree) should log ontoJOIN U of T, click on Check Status, and follow the instructions for making changes to your application.We do not accept any changes or corrections via email or telephone.",
            "When will I hear from the university after I submit my application?You will receive an acknowledgment from U of T, with login instructions for our applicant website,JOIN U of T, about two weeks after you submit your application.",
            "How do I contact University Admissions and Outreach?Telephone & In-Person InquiriesWe are available for telephone and in-person inquiries.Email InquiriesConnect with us by email for:Admissions:apply.adm.utoronto.ca/register/questionsAsk a Student:apply.adm.utoronto.ca/register/askastudentContactClient Servicesfor financial aid inquires including:OSAP (Ontario Student Assistant Program) full and part-timeBSWD (Bursaries for Students with Disabilities)UTAPS (University of Toronto Advanced Planning for Students)Part-Time FinancialOOP Funding for other provinces outside of OntarioUS student aid – for United States citizens (US Federal Student Aid loan opportunities, private loans (non-government), Veteran Affairs certification requests for benefits & education tax creditYour feedback is important to us. Please take a couple of minutes to let us know how we did by completing ourUniversity Admissions and Outreach Satisfaction Survey.",
            "Admissions:apply.adm.utoronto.ca/register/questions",
            "Ask a Student:apply.adm.utoronto.ca/register/askastudent",
            "OSAP (Ontario Student Assistant Program) full and part-time",
            "BSWD (Bursaries for Students with Disabilities)",
            "UTAPS (University of Toronto Advanced Planning for Students)",
            "Part-Time Financial",
            "OOP Funding for other provinces outside of Ontario",
            "US student aid – for United States citizens (US Federal Student Aid loan opportunities, private loans (non-government), Veteran Affairs certification requests for benefits & education tax credit",
            "How can I defer my offer of admission?If you are unable to begin your degree studies in the fall, you may request a one-year deferral of your offer of admission. Deferrals are not guaranteed and will be reviewed on a case-by-case basis. Check out further information ondeferring an offer of admission."
          ],
          [
            "Admissions:apply.adm.utoronto.ca/register/questions",
            "Ask a Student:apply.adm.utoronto.ca/register/askastudent"
          ],
          [
            "OSAP (Ontario Student Assistant Program) full and part-time",
            "BSWD (Bursaries for Students with Disabilities)",
            "UTAPS (University of Toronto Advanced Planning for Students)",
            "Part-Time Financial",
            "OOP Funding for other provinces outside of Ontario",
            "US student aid – for United States citizens (US Federal Student Aid loan opportunities, private loans (non-government), Veteran Affairs certification requests for benefits & education tax credit"
          ]
        ]
      },
      "largest_section": "How to Apply",
      "sections": [
        "main",
        "Apply to U of T",
        "Admissions",
        "How to Apply"
      ],
      "content_categories": [
        "tuition",
        "program",
        "deadline",
        "admission",
        "contact",
        "international"
      ],
      "information_types": "",
      "content_density": 0.0755,
      "content_quality": "high",
      "university": "University of Toronto",
      "from_cache": true
    }
  }
]